# NaN - means Not a Number

In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
n = np.nan
n

nan

In [8]:
type(n)  # nan是float类型

float

In [9]:
m = 1
m + n

nan

# Nan in Series

In [10]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A','B','C','D','E'])

In [11]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [12]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [13]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [14]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [16]:
s1.dropna() # 筛出 nan

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# NaN in DataFrame

In [17]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [18]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [19]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [20]:
dframe.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [25]:
df1 = dframe.dropna(axis=0) #只保留没有nan的行
df1

     0    1    2
0  1.0  2.0  3.0

In [32]:
df1 = dframe.dropna(axis=1) #只保留没有nan的列
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [39]:
df1 = dframe.dropna(axis=0,how='all') # all 全是NaN才会被删掉

In [41]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [42]:
dframe.sum(axis=0)

0     8.0
1     7.0
2    18.0
dtype: float64

In [46]:
dframe.dropna(thresh=None) # 把没有数据的0清除

     0    1    2
0  1.0  2.0  3.0

In [47]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [48]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [49]:
df2 = dframe2.dropna(thresh=2) # None 数目 大于2 都会被删掉

In [50]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [51]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [53]:
dframe2.fillna(value=1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [54]:
dframe2.fillna(value={0:0,1:1,2:2,3:3}) # 第一列0，第二列1 第三列2 第四列3

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [55]:
df1 = dframe

In [56]:
df2 = dframe2

In [57]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [58]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [59]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [60]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [61]:
df1.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [62]:
df1  # 原始值都不改变

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN